---
kind: property
id: P:Autodesk.Revit.DB.ExportLayerKey.SpecialType
source: html/6f7b1b9a-4d9d-c84d-df06-69b332a3404c.htm
---
# Autodesk.Revit.DB.ExportLayerKey.SpecialType Property

The special type for layer key.

## Syntax (C#)
```csharp
public SpecialType SpecialType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration